In [1]:
import pickle

In [2]:
with open("model1","rb") as f:
    model=pickle.load(f)

In [3]:
model.predict([[530,0]])

array([5409917.3553719])

In [4]:
import joblib

In [5]:
model=joblib.load("model2")

In [6]:
model.predict([[530,0]])

array([5409917.3553719])

In [7]:
import pandas as pd

In [8]:
df=pd.read_csv("home_prices3.csv")
df

   area    city         price
0   300  mumbai  2.837466e+06
1   250  nagpur  1.673003e+06
2   400    pune  2.745455e+06
3   700  mumbai  7.311295e+06
4   350  nagpur  2.791460e+06
5   650  mumbai  6.752066e+06

In [9]:
from sklearn.preprocessing import LabelEncoder

In [10]:
le=LabelEncoder()

In [11]:
df["city_n"]=le.fit_transform(df.city)

In [12]:
df

   area    city         price  city_n
0   300  mumbai  2.837466e+06       0
1   250  nagpur  1.673003e+06       1
2   400    pune  2.745455e+06       2
3   700  mumbai  7.311295e+06       0
4   350  nagpur  2.791460e+06       1
5   650  mumbai  6.752066e+06       0

In [13]:
df["price"]=model.predict(df[["area","city_n"]])

In [14]:
df

   area    city         price  city_n
0   300  mumbai  2.837466e+06       0
1   250  nagpur  1.673003e+06       1
2   400    pune  2.745455e+06       2
3   700  mumbai  7.311295e+06       0
4   350  nagpur  2.791460e+06       1
5   650  mumbai  6.752066e+06       0

In [15]:
df.drop("city_n",axis=1,inplace=True)

In [16]:
df

   area    city         price
0   300  mumbai  2.837466e+06
1   250  nagpur  1.673003e+06
2   400    pune  2.745455e+06
3   700  mumbai  7.311295e+06
4   350  nagpur  2.791460e+06
5   650  mumbai  6.752066e+06

In [17]:
df.to_csv("home_prices3.csv",index=False)